-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: ticket
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `run_date`
--

DROP TABLE IF EXISTS `run_date`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `run_date` (
  `time_code` bigint NOT NULL AUTO_INCREMENT,
  `content_code` bigint DEFAULT NULL,
  `date` varchar(100) DEFAULT NULL,
  `time` time DEFAULT NULL,
  `actor_name` varchar(255) DEFAULT NULL,
  `days` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`time_code`),
  KEY `FKgwc5us5j8ps4wajwwa4xkv8yc` (`content_code`),
  CONSTRAINT `FKgwc5us5j8ps4wajwwa4xkv8yc` FOREIGN KEY (`content_code`) REFERENCES `content` (`content_code`)
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `run_date`
--

LOCK TABLES `run_date` WRITE;
/*!40000 ALTER TABLE `run_date` DISABLE KEYS */;
INSERT INTO `run_date` VALUES (1,260,'2024-06-25','20:00:00','윤은오,장민제,이시안','화'),(2,260,'2024-06-26','20:00:00','윤은오,박진주,최호중','수'),(3,260,'2024-06-27','20:00:00','신재범,홍지희,최호중','목'),(4,260,'2024-06-28','20:00:00','정욱진,장민제,이시안','금'),(5,260,'2024-06-29','15:00:00','신재범,박진주,이시안','토'),(6,260,'2024-06-29','19:00:00','윤은오,홍지희,이시안','토'),(7,260,'2024-06-30','14:00:00','정욱진,박진주,최호중','일'),(8,260,'2024-06-30','18:00:00','신재범,장민제,최호중','일'),(9,260,'2024-07-02','20:00:00','신재범,박진주,이시안','화'),(10,260,'2024-07-03','20:00:00','정욱진,홍지희,최호중','수'),(11,260,'2024-07-04','20:00:00','윤은오,장민제,최호중','목'),(12,260,'2024-07-05','20:00:00','신재범,홍지희,이시안','금'),(13,260,'2024-07-06','15:00:00','정욱진,장민제,최호중','토'),(14,260,'2024-07-06','19:00:00','정욱진,박진주,최호중','토'),(15,260,'2024-07-07','14:00:00','윤은오,홍지희,이시안','일'),(16,260,'2024-07-07','18:00:00','신재범,장민제,이시안','일'),(17,260,'2024-07-09','20:00:00','신재범,박진주,최호중','화'),(18,260,'2024-07-10','20:00:00','윤은오,홍지희,최호중','수'),(19,260,'2024-07-11','20:00:00','장욱진,장민제,이시안','목'),(20,260,'2024-07-12','20:00:00','신재범,홍지희,최호중','금'),(21,260,'2024-07-13','15:00:00','정욱진,박진주,최호중','토'),(22,260,'2024-07-14','19:00:00','신재범,장민제,최호중','토'),(23,260,'2024-07-15','14:00:00','윤은오,박진주,이시안','일'),(24,260,'2024-07-15','18:00:00','정욱진,홍지희,이시안','일'),(25,260,'2024-07-16','20:00:00','정욱진,박진주,이시안','화'),(26,260,'2024-07-17','20:00:00','신재범,장민제,최호중','수'),(27,260,'2024-07-18','20:00:00','윤은오,홍지희,최호중','목'),(28,260,'2024-07-19','20:00:00','정욱진,장민제,최호중','금'),(29,260,'2024-07-20','15:00:00','윤은오,박진주,이시안','토'),(30,260,'2024-07-20','19:00:00','신재범,홍지희,이시안','토'),(31,260,'2024-07-21','14:00:00','정욱진,장민제,최호중','일'),(32,260,'2024-07-21','18:00:00','윤은오,박진주,최호중','일'),(33,260,'2024-07-23','20:00:00','윤은오,장민제,최호중','화'),(34,260,'2024-07-24','20:00:00','정욱진,박진주,이시안','수'),(35,260,'2024-07-25','20:00:00','신재범,홍지희,이시안','목'),(36,260,'2024-07-26','20:00:00','윤은오,장민제,최호중','금'),(37,260,'2024-07-27','15:00:00','정욱진,홍지희,최호중','토'),(38,260,'2024-07-27','19:00:00','신재범,장민제,최호중','토'),(39,260,'2024-07-28','14:00:00','신재범,박진주,이시안','일'),(40,260,'2024-07-28','18:00:00','윤은오,홍지희,이시안','일'),(41,260,'2024-07-30','20:00:00','윤은오,홍지희,이시안','화'),(42,260,'2024-07-31','20:00:00','신재범,박진주,이시안','수'),(43,260,'2024-08-01','20:00:00','윤은오,장민제,최호중','목'),(44,260,'2024-08-02','20:00:00','정욱진,장민제,최호중','금'),(45,260,'2024-08-03','15:00:00','윤은오,박진주,이시안','토'),(46,260,'2024-08-03','19:00:00','정욱진,홍지희,이시안','토'),(47,260,'2024-08-04','14:00:00','정욱진,장민제,최호중','일'),(48,260,'2024-08-04','18:00:00','신재범,홍지희,최호중','일');
/*!40000 ALTER TABLE `run_date` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-07-10 10:00:43
